000100 ID DIVISION.
000200 PROGRAM-ID. PRGDATA1.
000300 AUTHOR. SIVA KRISHNA.
000400* PROGRAM TO WRITE INTO OUTPUT FILE AFTER COMPARING BETWEEN MASTER
000500* AND TRANSACTION FILE.
000600*
000700*
000800 ENVIRONMENT DIVISION.
000900 INPUT-OUTPUT SECTION.
001000 FILE-CONTROL.
001100     SELECT MASTER ASSIGN TO MAINFILE
001200     ORGANIZATION  IS SEQUENTIAL.
001300     SELECT TRANS  ASSIGN TO TRANFILE
001400     ORGANIZATION  IS SEQUENTIAL.
001500     SELECT OUTFILE ASSIGN TO OUTFILE
001600     ORGANIZATION  IS SEQUENTIAL.
001700*
001800 DATA DIVISION.
001900 FILE SECTION.
002000 FD MASTER.
002100       COPY COPYLIB REPLACING ==(XX)==  BY ==MASTER== .
002200*01 MASTER-REC.
002300 FD TRANS.
002400       COPY COPYLIB REPLACING ==(XX)==  BY ==TRANS== .
002500 FD OUTFILE.
002600       COPY COPYLIB REPLACING ==(XX)==  BY ==OUTFILE== .
002700*
002800 WORKING-STORAGE SECTION.
002900 77 FILE-POSITION1 PIC 99.
003000    88 END-OF-FILE1 VALUE 01.
003100    88 ERROR-IN-READ  VALUE 99.
003200 77 FILE-POSITION2 PIC 99.
003300    88 END-OF-FILE2 VALUE 01.
003400    88 ERROR-IN-READ  VALUE 99.
003500 01 A PIC X(80) VALUE ALL '*'.
003600*
003700 PROCEDURE DIVISION.
003800*
003810      PERFORM A100-INITIALIZE-PARA.
003820      PERFORM A200-MAINPROCES-PARA.
003830      PERFORM A300-TERMINATE-PARA.
003840      STOP RUN.
003850*
003860*
003870 A100-INITIALIZE-PARA.
004000     DISPLAY 'START OF THE PROGRAM'.
004200     OPEN INPUT MASTER,
004300          INPUT TRANS,
004400          OUTPUT OUTFILE.
004500      DISPLAY 'FILE OPENING COMPLETED'.
004510      PERFORM A110-READ-FILE1-PARA.
004520      PERFORM A120-READ-FILE2-PARA.
004701*
004702*
004710 A200-MAINPROCES-PARA.
004800      PERFORM A201-LOOP-PARA UNTIL END-OF-FILE2.
004801      DISPLAY 'END-OF LOOP'.
004802*
004803*
004803*
004810 A300-TERMINATE-PARA.
004900      CLOSE MASTER , TRANS, OUTFILE.
005000      DISPLAY 'FILE CLOSING SUCESSFUOL'.
005100*
005120*
005200 A201-LOOP-PARA.
005300      IF END-OF-FILE1
005400           DISPLAY 'END-OF-FILE1#'
005500           IF END-OF-FILE2
005600               DISPLAY 'FILE 2 ALSO END'
005700           ELSE
005800               PERFORM A130-WRITE-FILE3-PARA
005900               PERFORM A120-READ-FILE2-PARA
006100           END-IF
006200      ELSE
006300           IF MASTER-EID = TRANS-EID
006400                 PERFORM A110-READ-FILE1-PARA
006600                 PERFORM A120-READ-FILE2-PARA
006800                 DISPLAY ' BOTH FILES READ'
007000           ELSE
007100                 IF MASTER-EID > TRANS-EID
007200                      THEN
007300                      PERFORM A130-WRITE-FILE3-PARA
007400                      PERFORM A120-READ-FILE2-PARA
007600                 ELSE
007700                      PERFORM A110-READ-FILE1-PARA
007900                 END-IF
008000           END-IF
008100      END-IF.
008110*
008120*
008200 A110-READ-FILE1-PARA.
008300      READ MASTER AT END MOVE 01 TO FILE-POSITION1.
008310*
008320*
008400 A120-READ-FILE2-PARA.
008500      READ TRANS  AT END MOVE 01 TO FILE-POSITION2.
008520*
008600 A130-WRITE-FILE3-PARA.
008700      WRITE OUTFILE-REC FROM TRANS-REC.
008800*
008900*